#include<iostream>;
int main() {
	//二维数组定义方式
	/*
	1.数据类型 数组名 [ 行数 ][ 列数 ]；
	2.数据类型 数组名 [ 行数 ][ 列数 ] = { { 数据1,数据2 } , { 数据3,数据4 } };
	3.数据类型 数组名 [ 行数 ][ 列数 ] = { 数据1,数据2,数据3,数据4 };
	4.数据类型 数组名 [  ][ 列数 ]  = { 数据1,数据2,数据3,数据4 };
	*/

	//1.数据类型 数组名 [ 行数 ][ 列数 ]；
	int arr[2][3];
	arr[0][0] = 1;
	arr[0][1] = 2;
	arr[0][2] = 3;
	arr[1][0] = 4;
	arr[1][1] = 5;
	arr[1][2] = 6;
	for (int i = 0; i < 2; i++) {
		for (int j = 0; j < 3; j++) {
			std::cout << arr[i][j] << " ";
		}
	}
	std::cout << "\n";//换个行继续~
	std::cout << "\n";
	//2.数据类型 数组名[行数][列数] = { { 数据1,数据2 } , { 数据3,数据4 } };
	int arr2[2][3] = {
		{1,2,3},
		{4,5,6}
	};
	for (int i = 0; i < 2; i++) {
		for (int j = 0; j < 3; j++) {
			std::cout << arr2[i][j] << " ";
		}
		std::cout << "\n";
	}
	std::cout << "\n";
	//3.数据类型 数组名[行数][列数] = { 数据1,数据2,数据3,数据4 };
	int arr3[2][3] = { 1,2,3,4,5,6 };
	for (int i = 0; i < 2; i++) {
		for (int j = 0; j < 3; j++) {
			std::cout << arr3[i][j] << " ";
		}
		std::cout << "\n";
	}
	std::cout << "\n";
	//4.数据类型 数组名 [  ][ 列数 ]  = { 数据1,数据2,数据3,数据4 };
	int arr4[][3] = { 1,2,3,4,5,6 };
	for (int i = 0; i < 2; i++) {
		for (int j = 0; j < 3; j++) {
			std::cout << arr4[i][j] << " ";
		}
		std::cout << "\n";
	}
	std::cout << "\n";
	std::cout << "你看出这些输出虽然一样，但是有着定义逻辑上区别吗？\n反正我喜欢第二种~" << std::endl;
	system("pause");
	return 0;
}