//2026.7.30
#include<iostream>
int main() {
	//接下来是数组的学习
	//数组就是一个集合，里面存放了相同类型的数据元素
	//黑马程序员为什么举了一个南孚电池与包装南孚电池的例子啊，南孚打钱！！！
	
	/*
	数组的特点：
	1、放在一块连续的内存空间中
	2、数组中每个元素都是相同的数据类型
	例：arr[0]
	        ↑这个就是下标，我们可以通过下标来访问数组中的元素，下标一般从0开始
	数组例子：
	1. 数据类型  数组名[ 数组长度 ];
	2. 数据类型  数组名[ 数组长度 ] = { 值1,值2...};
	3. 数据类型  数组名[  ] = { 值1, 值2, ...};
	*/

	//1、
	//int arr[5];//给数组赋值
	//数组下标从0开始索引的
	//arr[0] = 10;
	//arr[1] = 20;
	//arr[2] = 30;
	//arr[3] = 40;
	//arr[4] = 50;
	//访问数据元素
	//std::cout << arr[0] << std::endl;

	//2、
	//int arr2[5] = { 10,20,30,40,50 };
	//std::cout << arr2[0] << std::endl;
	//std::cout << arr2[1] << std::endl;
	//std::cout << arr2[2] << std::endl;
	//std::cout << arr2[3] << std::endl;
	//std::cout << arr2[4] << std::endl;
	//std::cout << "\n接下来是for循环，不用再当Ctrl CV 工程师了~" << std::endl;
	////利用循环 输出数组中的元素
	//for (int i = 0; i < 5; i++) {//如果初始化数据时候没有全部填写完，那么会用0来填补剩余的数据
	//	std::cout << arr2[i] << std::endl;
	//}

	//3、
	int arr3[] = { 90,80,70,60,50,40,30,20,10 };
	//定义数组时候必须有一个初始长度
	for (int i = 0; i < 9; i++) {
		std::cout << arr3[i] << std::endl;
	}
	system("pause");
	return 0;
}